Revit 2027 API
ElectricalSystem.Create(Connector, ElectricalSystemType) Method
 Creates a new MEP Electrical System element from an unused Connector.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElectricalSystem Create(
	Connector connector,
	ElectricalSystemType elecSysType
)
Public Shared Function Create (
	connector As Connector,
	elecSysType As ElectricalSystemType
) As ElectricalSystem
public:
static ElectricalSystem^ Create(
	Connector^ connector,
	ElectricalSystemType elecSysType
)
static member Create :
        connector : Connector *
        elecSysType : ElectricalSystemType -> ElectricalSystem
Parameters
connector Connector
 The Connector to create this Electrical System.
elecSysType ElectricalSystemType
 The System Type of electrical system.
Return Value
ElectricalSystem
 If successful a new MEP Electrical System element within the project, otherwise null.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ElectricalSystem Class
Create Overload
Autodesk.Revit.DB.Electrical Namespace